Data/Final_Implemented_data/Request/Implemented 400/Implemented 400/test_wrr4.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient)


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /test_100kb.txt
Document Length:        102400 bytes

Concurrency Level:      10
Time taken for tests:   13.993 seconds
Complete requests:      400
Failed requests:        0
Total transferred:      41036000 bytes
HTML transferred:       40960000 bytes
Requests per second:    28.58 [#/sec] (mean)
Time per request:       349.835 [ms] (mean)
Time per request:       34.984 [ms] (mean, across all concurrent requests)
Transfer rate:          2863.79 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       16  282  77.9    274     501
Processing:     1   63  64.6     49     505
Waiting:        0   63  64.5     48     504
Total:         19  345  93.3    336     647

Percentage of the requests served within a certain time (ms)
  50%    336
  66%    381
  75%    411
  80%    427
  90%    457
  95%    507
  98%    543
  99%    594
 100%    647 (longest request)